Revit 2024 API
RebarContainerType.CreateDefaultRebarContainerType Method
 Creates a new RebarContainerType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static ElementId CreateDefaultRebarContainerType(
	Document aDoc
)
Visual Basic
Public Shared Function CreateDefaultRebarContainerType ( _
	aDoc As Document _
) As ElementId
Visual C++
public:
static ElementId^ CreateDefaultRebarContainerType(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The newly created type id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace